cases/F22_lamb_oseen/case/system/blockMeshDict.template
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }
// F22 Lamb-Oseen: [-L, L]^2 with L = 2.5, unit depth; far-field velocity fixed (potential vortex).
scale   1;
vertices
(
    (-2.5 -2.5 0)  (2.5 -2.5 0)  (2.5 2.5 0)  (-2.5 2.5 0)
    (-2.5 -2.5 1)  (2.5 -2.5 1)  (2.5 2.5 1)  (-2.5 2.5 1)
);
blocks ( hex (0 1 2 3 4 5 6 7) (__N__ __N__ 1) simpleGrading (1 1 1) );
edges ();
boundary
(
    left   { type patch; faces ((0 4 7 3)); }
    right  { type patch; faces ((1 2 6 5)); }
    bottom { type patch; faces ((0 1 5 4)); }
    top    { type patch; faces ((3 7 6 2)); }
    frontAndBack { type empty; faces ((0 3 2 1) (4 5 6 7)); }
);
