cases/F22_lamb_oseen/case/constant/transportProperties
FoamFile { version 2.0; format ascii; class dictionary; object transportProperties; }
nu              0.01;       // must equal exact_f22.NU (checked by the launcher)
